Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: Some language environments may modify the case conversions of @acronym{ASCII} characters; for example, in the Turkish language environment, the @acronym{ASCII} character @samp{I} is downcased into a Turkish ``dotless i''. This can interfere with code that requires ordinary ASCII case conversion, such as implementations of @acronym{ASCII}-based network protocols. In that case, use the @code{with-case-table} macro with the variable @var{ascii-case-table}, which stores the unmodified case table for the @acronym{ASCII} character set.
fr_fr: Certains environnements linguistiques peuvent modifier les conversions de casse des caractères @acronym{ASCII} ; par exemple, dans l'environnement de langue turc, le caractère @acronym{ASCII} @samp{I} se transforme en bas de casse et devient le ``i sans point'' turc. Cela peut interférer avec du code qui nécessite une conversion de casse @acronym{ASCII} ordinaire, comme les implémentations des protocoles de réseau basés sur @acronym{ASCII}. Dans ce cas, il faut utiliser la macro @code{with-case-table} avec la variable @var{ascii-case-table} qui stocke le tableau de casse non modifié pour l'ensemble de caractères @acronym{ASCII}.

source: Some of these conventions are ignored for specification characters for which they do not make sense. That is, @samp{%s}, @samp{%S} and @samp{%c} accept a width starting with 0, but still pad with @emph{spaces} on the left. Also, @samp{%%} accepts a width, but ignores it. Here are some examples of padding:
fr_fr: Certaines de ces conventions sont ignorées par les caractères de spécification pour lesquels elles n'ont pas de sens. Autrement dit, @samp{%s}, @samp{%S} et @samp{%c} acceptent une largeur commençant par zéro, mais ils font quand même du remplissage avec @emph{espaces} à gauche. En outre, @samp{%%} accepte une largeur, mais l'ignore. Voici quelques exemples de bourrage :

source: Sometimes it is useful to compare numbers with @code{equal}; it treats two numbers as equal if they have the same data type (both integers, or both floating point) and the same value. By contrast, @code{=} can treat an integer and a floating point number as equal. @xref{Equality Predicates}.
fr_fr: Parfois il est utile de comparer des nombres avec @code{equal}; les deux nombres sont traités comme égaux s'ils ont le même type de données (les deux sont des nombres entiers, ou à virgule flottante) et la même valeur. En revanche, @code{=} peut traiter un nombre entier et un nombre à virgule flottante en tant qu'égaux. @xref{Equality Predicates}.

source: Sometimes key sequences are represented as strings. When a string is a key sequence, string elements in the range 128 to 255 represent meta characters (which are large integers) rather than character codes in the range 128 to 255.
fr_fr: Parfois, les séquences de touches sont représentées sous forme de chaînes de caractères. Quand une chaîne est une suite de touche, les éléments de la chaîne dans la gamme de 128 à 255 représentent les meta-caractères (qui sont de large integers) plutôt que des codes de caractères dans la gamme de 128 à 255.

source: Sometimes to help describe one form we show another form that produces identical results. The exact equivalence of two forms is indicated with @samp{@equiv{}}.
fr_fr: Parfois pour aider à décrire un formulaire, nous montrons un autre formulaire qui produit des résultats identiques. L'équivalence exacte de deux formulaires est indiquée avec le @samp{@equiv{}}.

source: Somewhat odd, but predictable, behavior can occur for certain ``non-greedy'' values of @var{separators} that can prefer empty matches over non-empty matches. Again, such values rarely occur in practice:
fr_fr: Un comportement un peu bizarre mais prévisible peut se produire pour certaines valeurs de @var{separators} " peu gourmandes" qui peuvent préférer des correspondances vides à des correspondances non vides. Encore une fois, on rencontre ces valeurs rarement dans la pratique:

source: Special characteristics of Emacs Lisp vectors.
fr_fr: Caractéristiques particulières aux vecteurs Emacs Lisp.

source: Special form descriptions use a more complex notation to specify optional and repeated arguments because they can break the argument list down into separate arguments in more complicated ways. @samp{@r{[}@var{optional-arg}@r{]}} means that @var{optional-arg} is optional and @samp{@var{repeated-args}@dots{}} stands for zero or more arguments. Parentheses are used when several arguments are grouped into additional levels of list structure. Here is an example:
fr_fr: Les descriptions de formulaire spécial emploient une notation plus complexe pour indiquer des arguments facultatifs et répétés parce qu'elles peuvent démonter la liste d'argument en arguments séparés de manières plus compliquées. @samp{@r{[}@var{optional-arg}@r{]}} signifie que @var{optional-arg} est facultatif et @samp{@var{reapeated-args}@dots{}} représente zéro arguments ou plus. Des parenthèses sont employées quand plusieurs arguments sont groupés dans les niveaux additionnels de la structure de liste. Voici un exemple :

source: Specifying abbreviations and their expansions.
fr_fr: Spécifier des abréviations et leurs expansions.

source: Standard Abbrev Tables
fr_fr: Tables standard d'abréviations

source: Standard Errors
fr_fr: Erreurs standard

source: Standard Mathematical Functions
fr_fr: Fonctions mathématiques standards

source: Storing a new element into the copy does not affect the original @var{sequence}, and vice versa. However, the elements of the new sequence are not copies; they are identical (@code{eq}) to the elements of the original. Therefore, changes made within these elements, as found via the copied sequence, are also visible in the original sequence.
fr_fr: Stocker un nouvel élément dans la copie ne change rien à la @var{sequence} d'origine, et vice versa. Cependant, les éléments de la nouvelle suite ne sont pas des copies ; ce sont les mêmes (@code{eq}) que ceux de la suite d'origine. Ainsi, les changements effectués sur ces éléments sont visibles dans les deux suites, celle d'origine et celle copiée.

source: String Basics
fr_fr: Notions de base sur les chaînes et les caractères

source: String Conversion
fr_fr: Conversion des caractères et des chaînes

source: String and Character Basics
fr_fr: Chaînes de caractères et caractères : les bases

source: Strings and Characters
fr_fr: Chaînes et caractères

source: Strings are printed in a way that shows the contents more clearly as text.
fr_fr: Les tableaux type @code{strings} s'affichent d'une façon qui montre plus clairement le contenu car il s'agit de texte.

source: Strings are useful for holding regular expressions. You can also match regular expressions against strings with @code{string-match} (@pxref{Regexp Search}). The functions @code{match-string} (@pxref{Simple Match Data}) and @code{replace-match} (@pxref{Replacing Match}) are useful for decomposing and modifying strings after matching regular expressions against them.
fr_fr: Les chaînes de caractères sont utiles pour contenir les expressions régulières. On peut également faire correspondre les expressions régulières et les chaînes avec @code{string-match} (voir la section @xref{Regular Expression Searching}). Les fonctions @code{match-string} (voir la section @xref{Simple Match Data Access}) et @code{replace-match} (voir la section @xref{Replacing the Text that Matched}) sont utiles pour la décomposition et la modification des chaînes après les avoir transtypées en expressions régulières.

source: Strings can hold text properties. @xref{Text Properties}.
fr_fr: Les tableaux type @code{strings} peuvent contenir des propriétés textuelles. @xref{Text Properties}.

source: Strings cannot hold characters that have the hyper, super or alt modifiers; they can hold @acronym{ASCII} control characters, but no other control characters. They do not distinguish case in @acronym{ASCII} control characters. If you want to store such characters in a sequence, such as a key sequence, you must use a vector instead of a string. @xref{Character Type}, for more information about the representation of meta and other modifiers for keyboard input characters.
fr_fr: Les chaînes de caractères ne peuvent pas contenir de caractères qui sont la combinaison entre un caractère quelconque et la touche hyper, super ou atl ; elles peuvent contenir des caractères de contrôle @acronym{ASCII}, mais pas d'autres caractères de contrôle. Elles ne distinguent pas la casse sur les caractères de contrôles @acronym{ASCII}. Si vous souhaitez stocker ces caractères sous la forme d’une suite, comme une suite de touches, vous devez utiliser un vecteur plutôt qu’une chaîne. Voir la section @xref{Character Type}, pour plus d’informations sur la représentation des modificateurs meta et autres pour les caractères saisis au clavier.

source: Strings, and functions that work on them.
fr_fr: Chaînes et fonctions qui sont basés sur elles.

source: Symbol Components
fr_fr: Composants des symboles

source: Symbol Type
fr_fr: Le type symbole

source: Symbols
fr_fr: Symboles

source: Symbols are also allowed as arguments, in which case their print names are used.
fr_fr: Les symboles sont aussi autorisés comme arguments, auquel cas c'est leurs noms qui sont utilisés.

source: Symbols have names, values, function definitions
fr_fr: Les symboles ont des noms, des valeurs, des définitions de fonction

source: Symbols represent names, uniquely.
fr_fr: Les symboles représentent des noms, de façon unique.

source: Syntax Tables
fr_fr: Tables de syntaxe

source: Tables: Abbrev Tables
fr_fr: Tables : Tables d'abréviations

source: Testing for numbers.
fr_fr: Tester les nombres.

source: Testing whether an object is a string or char.
fr_fr: Test pour voir si un objet est une chaîne ou un caractères.

source: Text
fr_fr: Texte

source: Text Comparison
fr_fr: Comparaison des caractères et des chaînes

source: The @code{-} function serves two purposes: negation and subtraction. When @code{-} has a single argument, the value is the negative of the argument. When there are multiple arguments, @code{-} subtracts each of the @var{more-numbers-or-markers} from @var{number-or-marker}, cumulatively. If there are no arguments, the result is 0.
fr_fr: La fonction @code{-} atteint deux objectifs : négation et soustraction. Quand @code{-} a un argument simple, la valeur est le négatif de l'argument. Quand il y a des arguments multiples, @code{-} soustrait chacun des @var{more-numbers-or-markers} de @var{number-or-marker}, de manière cumulée. S'il n'y a aucun argument, le résultat est 0.

source: The @code{append} function also provides a way to convert a vector into a list with the same elements:
fr_fr: La fonction @code{append} permet aussi la conversion d'un vecteur en une liste contenant les mêmes éléments :

source: The @code{concat} function always constructs a new string that is not @code{eq} to any existing string.
fr_fr: La fonction @code{concat} construit toujours une nouvelle chaîne qui n'est @code{eq} à aucune chaîne existante.

source: The @code{vconcat} function also allows byte-code function objects as arguments. This is a special feature to make it easy to access the entire contents of a byte-code function object. @xref{Byte-Code Objects}.
fr_fr: La fonction @code{vconcat} prend aussi comme arguments des objets de fonctions en code octet. C'est une caractéristique particulière pour faciliter l'accès à tout le contenu d'un objet d'une fonction en code octet. @xref{Byte-Code Objects}.

source: The @code{wholenump} predicate (whose name comes from the phrase ``whole-number-p'') tests to see whether its argument is a nonnegative integer, and returns @code{t} if so, @code{nil} otherwise. 0 is considered non-negative.
fr_fr: L'attribut @code{wholenump} (dont le nom vient de l'expression « whole-number-p ») teste pour voir si son argument est un nombre entier non négatif, et renvoie le @code{t} si oui, @code{nil} autrement. 0 est considéré non négatif.

source: The @code{with-case-table} macro saves the current case table, makes @var{table} the current case table, evaluates the @var{body} forms, and finally restores the case table. The return value is the value of the last form in @var{body}. The case table is restored even in case of an abnormal exit via @code{throw} or error (@pxref{Nonlocal Exits}).
fr_fr: La macro @code{with-case-table} enregistre le tableau de casse courant, le définit à la valeur du paramètre @var{table}, évalue la forme du paramètre @var{body}, et enfin restaure le tableau de casse. La valeur de retour est la valeur de la dernière forme de @var{body}. Le tableau de casse est restauré même dans le cas où il y a une sortie anormale par le déclenchement d'une exception (@code{throw}) ou par une erreur (@pxref{Nonlocal Exits})

source: The @dfn{function cell} holds the function definition of the symbol. When a symbol is used as a function, its function definition is used in its place. This cell is also used to make a symbol stand for a keymap or a keyboard macro, for editor command execution. Because each symbol has separate value and function cells, variables names and function names do not conflict. See @code{symbol-function} in @ref{Function Cells}.
fr_fr: La @dfn{cellule de fonction} contient la définition de la fonction du symbole. Quand un symbole est utilisé comme fonction, sa définition de fonction est utilisée à la place. Cette cellule est aussi utilisée pour qu'un symbole représente une touche de clavier ou une combinaison de touches pour que l'éditeur commande l'exécution. Comme chaque symbole a des valeurs et des cellules de fonction séparées, les noms de variables et les noms de fonctions ne rentrent pas en conflit. Voir @code{symbol-function} dans @ref{Function Cells}.

source: The @dfn{print name cell} holds a string that names the symbol for reading and printing. See @code{symbol-name} in @ref{Creating Symbols}.
fr_fr: La @dfn{cellule de nom d'affichage} contient une chaîne de caractère qui nomme le symbole pour la lecture et l'affichage. Voir @code{symbol-name} dans @ref{Creating Symbols}.

source: The @dfn{property list cell} holds the property list of the symbol. See @code{symbol-plist} in @ref{Property Lists}.
fr_fr: La @dfn{cellule de liste de propriétés} contient la liste de propriétés du symbole. Voir @code{symbol-plist} dans @ref{Property Lists}.

source: The @dfn{value cell} holds the current value of the symbol as a variable. When a symbol is used as a form, the value of the form is the contents of the symbol's value cell. See @code{symbol-value} in @ref{Accessing Variables}.
fr_fr: La @dfn{cellule de valeur} contient la valeur actuelle du symbole comme variable. Quand un symbole est utilisé comme forme, la valeur de la forme est le contenu de la cellule de valeur du symbole. Voir @code{symbol-value} dans @ref{Accessing Variable Values}.

source: The Case Table
fr_fr: La table de casse

source: The Lisp reader reads an integer as a sequence of digits with optional initial sign and optional final period.
fr_fr: Le lecteur de Lisp lit un nombre entier comme une séquence de chiffres avec le signe initial et le point final facultatifs.

source: The Predicates for Strings
fr_fr: Les prédicats pour les chaînes

source: The appearance of the keyword @code{&optional} in the argument list indicates that the subsequent arguments may be omitted (omitted arguments default to @code{nil}). Do not write @code{&optional} when you call the function.
fr_fr: L'apparition du mot-clé @code{&optional} dans la liste d'argument indique que les arguments suivants peuvent être omis (les arguments omis se transfèrent comme @code{nil}). Ne pas écrire @code{&optional} quand vous appelez la fonction.

source: The argument @var{hook} is a function or @code{nil}. If @var{hook} is non-@code{nil}, then it is called with no arguments after the abbrev is replaced with @var{expansion}; point is located at the end of @var{expansion} when @var{hook} is called.
fr_fr: L'argument @var{hook} est une fonction ou @code{nil}. Si @var{hook} n'est pas @code{nil} alors il est appelé sans arguments après que l'abbréviation soit remplacée par @var{expansion}. Le point est situé à la fin de @var{expansion} quand @var{hook} est appelée.

source: The argument @var{name} should be a string. The argument @var{expansion} is normally the desired expansion (a string), or @code{nil} to undefine the abbrev. If it is anything but a string or @code{nil}, then the abbreviation ``expands'' solely by running @var{hook}.
fr_fr: L'argument @var{name} doit être une chaîne de caractères. L'argument @var{expansion} est normalement l'expansion souhaitée (une chaîne de caractères), or @code{nil} pour éliminer une abréviation. S'il n'est ni une chaîne de caractères ni @code{nil} alors l'abréviation se "développe" exclusivement en exécutant @var{hook}.

source: The authors, editors, and sponsors of this manual.
fr_fr: Les auteurs, les rédacteurs, et les commanditaires de ce manuel.

source: The bitwise operations in Emacs Lisp apply only to integers.
fr_fr: Les opérations de bits en Emacs Lisp s'appliquent seulement aux nombres entiers.

source: The canonicalize table maps all of a set of case-related characters into a particular member of that set.
fr_fr: La table "canonicalize" associe l'ensemble entier d'un jeu de caractères liés à la casse à un membre particulier de ce jeu.

source: The case table for the @acronym{ASCII} character set. This should not be modified by any language environment settings.
fr_fr: Le tableau de casse pour l'ensemble de caractères @acronym{ASCII}. Il ne faut pas que les paramètres d'environnement de langue modifient cela.

source: The category---function, variable, or whatever---appears at the beginning of the line.
fr_fr: La catégorie---fonction, variable, ou quoi que soit---est imprimé à côté de la marge.

source: The category---function, variable, or whatever---is printed next to the right margin.
fr_fr: La catégorie---fonction, variable, ou quoi que soit---est imprimé à côté de la marge.

source: The character case functions change the case of single characters or of the contents of strings. The functions normally convert only alphabetic characters (the letters @samp{A} through @samp{Z} and @samp{a} through @samp{z}, as well as non-@acronym{ASCII} letters); other characters are not altered. You can specify a different case conversion mapping by specifying a case table (@pxref{Case Tables}).
fr_fr: Les fonctions de casse de caractère changent la casse de caractères simples ou du contenu des chaînes. Normalement, les fonctions convertissent seulement les caractères alphabétiques (les lettres de @samp{A} à @samp{Z} et de @samp{a} à @samp{z}, ainsi que les lettres non @acronym{ASCII}); les autres caractères ne sont pas modifiés. On peut spécifier un mappage différent de conversion de casse en spécifiant un tableau de casse (@pxref{Case Tables}).

source: The characters in @var{string}, other than the format specifications, are copied directly into the output, including their text properties, if any.
fr_fr: Les caractères dans @var{string}, autres que les spécifications de format, sont directement copiés dans la sortie, y compris leurs propriétés textuelles, s'ils en possèdent.

source: The correspondences in a hash table are in no particular order.
fr_fr: Les correspondances dans une table de hachage n'ont pas d'ordre particulier.

source: The default for @var{weak} is @code{nil}, so that all keys and values referenced in the hash table are preserved from garbage collection.
fr_fr: La valeur par défaut pour @var{weak} est @code{nil}. Ainsi toutes les clés et toutes les valeurs référencées dans la table de hachage sont protégées du ramasse-miettes.

source: The default size is 65.
fr_fr: La valeur par défaut est 65.

source: The default value is 1.5.
fr_fr: La valeur par défaut est 1.5.

source: The default value of @var{separators} for @code{split-string}. Its usual value is @w{@code{"[ \f\t\n\r\v]+"}}.
fr_fr: La valeur par défaut de @var{separators} pour @code{split-string}. La valeur habituelle est @w{@code{"[ \f\t\n\r\v]+"}}.

source: The definition of a word is any sequence of consecutive characters that are assigned to the word constituent syntax class in the current syntax table (@pxref{Syntax Class Table}).
fr_fr: On définit un mot comme étant toute suite de caractères consécutifs qui sont attribués à la classe de syntaxe d'un composant de mot dans la syntaxe en cours (@pxref{Syntax Class Table}).

source: The description follows on succeeding lines, sometimes with examples.
fr_fr: La description suit les lignes réussies, parfois avec des exemples.

source: The elements of an array may be referenced or changed with the functions @code{aref} and @code{aset}, respectively (@pxref{Array Functions}).
fr_fr: Les éléments d'un tableau peuvent être référencés ou changés, respectivement avec les fonctions @code{aref} et @code{aset}, (@pxref{Array Functions}).

source: The elements of vectors and lists may be any Lisp objects. The elements of strings are all characters.
fr_fr: Les éléments contenus dans les vecteurs ou les listes peuvent être n'importe quel objet Lisp. Les éléments contenus dans les chaînes de caractères sont tous des caractères.

source: The equivalences table maps each one of a set of case-related characters into the next character in that set.
fr_fr: La table "equivalences" associe chacun des jeux de caractères liés à la casse à au caractère suivant dans ce jeu.

source: The examples below use the characters @samp{X} and @samp{x} which have @acronym{ASCII} codes 88 and 120 respectively.
fr_fr: Les exemples ci-dessous utilisent les caractères @samp{X} et @samp{x} qui ont respectivement pour code @acronym{ASCII} 88 et 120.

source: The extra table @var{canonicalize} maps each character to a canonical equivalent; any two characters that are related by case-conversion have the same canonical equivalent character. For example, since @samp{a} and @samp{A} are related by case-conversion, they should have the same canonical equivalent character (which should be either @samp{a} for both of them, or @samp{A} for both of them).
fr_fr: La table supplémentaire @var{canonicalize} associe chaque caractère à un équivalent canonique; deux caractères qui sont liés par la conversion de casse ont le même caractère équivalent canonique. Par exemple, puisque @samp{a} et @samp{A} sont liés par la conversion de casse, ils devraient avoir le même caractère équivalent canonique (qui devrait être soit @samp{a} pour les deux, ou @samp{A} pour les deux).

source: The extra table @var{equivalences} is a map that cyclically permutes each equivalence class (of characters with the same canonical equivalent). (For ordinary @acronym{ASCII}, this would map @samp{a} into @samp{A} and @samp{A} into @samp{a}, and likewise for each set of equivalent characters.)
fr_fr: La table supplémentaire @var{equivalences} est une mappe qui permute cycliquement chaque classe d'équivalence (de caractères avec le même équivalent canonique). (Pour le banal @acronym{ASCII}, on aurait l'association de @samp{a} à @samp{A} et de @samp{A} à @samp{a}, et de même pour chaque ensemble de caractères équivalents.)

source: The first element of an array has index zero, the second element has index 1, and so on. This is called @dfn{zero-origin} indexing. For example, an array of four elements has indices 0, 1, 2, @w{and 3}.
fr_fr: Le premier élément d'un tableau a comme indice zéro, le second élément l'indice 1, et ainsi de suite. On appelle cela l'indexation @dfn{origine-zéro}. Par exemple, un tableau de quatre éléments a les indices 0, 1, 2 et 3.
